activity
adr
age
agent
agents
alembic
and
answer
api
areas
ast
audit
auth
authors
background
batch
bearer
bff
branch
cache
canonical
capabilities
celery
check
child
class
classes
clean
cloud
command
common
constitution
content
context
contracts
cookie
create
csrf
current
daily
definitions
design
dir
directory
dispatch
docx
dramatiq
envelope
escape
events
exports
fast
fdfind
feature
file
find
format
foundational
from
generate
generation
get
git
graphify
grep
groups
gui
has
health
highest
http
hub
idempotency
implementation
init
invoke
issue
job
jobs
json
jsonb
kafka
key
kindergarten
kindergartenmanager
kindergartens
kit
lesson
lite
local
manager
model
monorepo
name
new
nice
nodes
only
open
outcome
paths
pending
persist
phase
plan
plans
polish
postgre
prd
pre
prerequisites
profile
profiles
prompt
prompts
python
query
quickstart
react
read
readme
red
redis
refresh
repo
repository
request
research
resolve
results
roadmap
roles
root
runs
saa
schema
script
sdd
sdk
seam
semesters
separator
session
settings
setup
snapshots
socket
source
sources
spec
specification
specify
speckit
specs
sql
sse
ssrf
storage
tasks
teachers
template
test
token
tokens
ttl
type
user
users
uui
versions
web
word
workday
worker
ywyz
一体化进程
一日活动反思
一日活动计划
一日活动计划业务不变量
一日活动计划采用固定
一键生成
一键生成与分栏目生成
一键生成四栏目
七个任务级提示词
七个稳定任务级提示词
七个稳定提示词
三进程启动
上传与立即清理
下一份文档查询记录
下午户外游戏
不包含范围
不可变导出输入与文件
不可误读的已确认决策
不等于公网开放
不继承旧仓库架构
与共享契约
与可信上下文
与工程技能规则
与提示词
与提示词规则
与教师决定权
与旧仓库
与旧仓库的关系
与来源信任
与验收合同
临时文件与原子输出
乐观锁契约
乐观锁禁止静默覆盖
事务所有权
事实来源
事实来源与优先级
事实来源与冲突处理
事实来源冲突时停止固化实现
五轮一致性验证记录
交付范围
交接与恢复工作
产品与工程路线图
产品与部署
产品只交付
产品目标
产品背景
从零生成
从首期保留园所隔离边界
从首期开始全面微服务化
代价与风险
令牌与
任务与
任务与栏目采用验收
任务头
任务实施
任务幂等契约
任务生成
任务生成策略
任务类型
任务转
作为任务最终状态存储
作者署名与当前授权分离
供应商中立
依赖方向
保存任务权威状态
保持最小实现
保留的路线经验
保真成果
修正后的一日活动计划数据模型结论
允许提示词定义输出
先定义完成标准
先理解再编码
六栏目
六阶段迁移顺序
共享契约
共享文档与模板同步
共享文档独立提交同步
共享父
共享设计基线
共同实施路线
关系表头与
关联决策
关键事务不变量
关键实体清单
兼容性
内容质量
冲突与高影响歧义共同冻结
决策索引
决策范围
出口门禁
分支与
分支内验证
分支协作规范
分支模型与所有权
分栏目生成
分阶段任务执行与验证
划分查询记录
创建后活动日期不可修改
创建或打开计划
前提与反目标
前端直接访问数据库或共享
功能完成前延后生产部署与访问网络决策
功能完成后
功能目录与可测试规格生成
功能规格模板
功能规格生成
功能验收
加密与数据最小化
包含范围
区分已确认设计与已实现状态
区域按目标栏目校验
历史快照
历史快照触发边界
历史恢复保留恢复前内容
反思三字段与
反思与集体部分成功
反思事务验收
变量白名单
只交付
只向浏览器返回临时文件
只读交叉评审
只追加收敛任务
只配置一个全局模型
可收集且业务断言失败的
可测试性
可观测性与审计
各任务输入快照
同时维护本地版和
同步执行
同班同日唯一当前教案
后台任务状态
后台任务状态机
后台任务状态机与
后台任务状态集合
后端模块单向依赖
后续子系统
启动前检查清单
周次与快照主题
周次与班级
园所与事务边界
园所与学期月份范围
园所与班级授权
园所与身份实体组
园所与身份模型
园所组合外键矩阵
园所组合外键规则
园所隔离
园所隔离与组合外键
固定结构化
固定阅读顺序
在线节假日
基本规则
基础能力
增量交付策略
备选方案
复审触发条件
复审输入
外部服务失败时默认普通工作日
外部集成
契约与验证指南
契约快速检查
契约总则与端点目录
契约演进
学期与周次
学期外周次双空
学期外周次双空检查约束
学期外教学周次双空
学期管理
安全与隐私硬性规则
安全初始化与必要设置
安全方案
完成交付
完整验收记录
实施与验证约束
实施依赖
实施前检查清单门禁
实施摘要
实施约束
实施规划
实施计划模板
实施顺序
实现分支授权边界
实现子
实现授权门禁
实现收敛
审计与可降级服务
审计与日志快照边界
审计与降级主题
审计与降级验收
审计事件
审计只插入约束
审计只记录必要元数据
审计端点
审计至少保留一年
室内区域游戏
宪章同步影响报告
宪章检查与两阶段设计门禁
宪章维护
容量与性能
密钥与安全边界
导出与历史
导出与历史验收
导出主题
导出前必须成功保存
导出前检查
导出历史
导出快照
导出格式控制
导出模型
导出端点
导出记录
将提示词写在代码或环境变量中
就绪性
层级与状态隔离
工作日
工作日与日期服务
工作日来源与三类缓存
工作日校验
工作流
工具优先级
工程骨架
工程骨架与质量基线
已具备
已安装工具与技能
幂等与恢复扫描
幂等与租约约束
并发与任务恢复成果
并建立管理员专用提示词系统
并行与独立验收校验
幼儿园信息
幼儿园教育管理系统
应用事务不变量
延后验收
开发规则
开始工作前
异常与降级
异步任务与反馈
异步提示词测试冻结配置
异步状态
异步生成
异步生成与人工采用
张表总览
归档与不可变历史
归档只读与恢复编辑
归档教案仍占唯一键
当前仓库与分支状态
当前共同下一步
当前学期与学期外日期
当前状态快照
当前非目标
待确认
必测数据行为
必要设置
必须另行决定
快照创建与不可变规则
快照只表达可恢复变化
性能与可访问性成果
总体建模原则
总体架构
意图清单与代码差距评估
成功标准
手工教案
执行授权边界与
执行状态机
技术上下文
技术与依赖基线
技术基线
投递协调
拒绝与清理约束
拒绝与过期
按用户故事生成可执行任务
授权与身份审计
排除范围
接入天气服务或让教师选择天气标签
提示词与
提示词服务与确定性渲染
提示词模型
提示词测试冻结输入
提示词测试运行
提示词白名单与发布版本
提示词端点
提示词管理
提示词管理子系统
搜索规范
故事与收尾阶段
故障与降级矩阵
故障时保留
故障隔离矩阵
敏感数据
教学周按周一递增
教学周次
教学设置实体组
教学设置模型
教师与班级
教师控制
教师控制成果
教师班级权限与管理员全园访问
教案乐观锁更新
教案六大正文栏目
教案快照
教案手工闭环
教案栏目与格式
教案端点
教案管理
教案结构化
数据与安全
数据与架构边界
数据保留与清理
数据库
数据库迁移与首次初始化
数据模型
数据模型与园所隔离
数据模型测试与验收
数据模型设计
数据模型边界查询记录
文件与状态约束
文件名与存储
文件第一行
文件第二行
文档同步
文档目的
文档职责与工具基线
文档职责与开发工具
新增集体环节标红
日志与错误处理
日期与上下文规则
日期与外部服务采用本地优先和软降级
日期校验只软提示
日期规则
日期选择与校验
旧仓库经验与反例
旧图谱未覆盖最新架构
时间与日期语义
明确不做
明确不重复的旧路线
星期与日期
星期与日期格式
晨间活动
晨间谈话
更新规则
最后一个有效管理员不可停用
最小实现边界
最小跨进程任务契约
服务边界与依赖方向
未来再迁移
本地优先
本地优先架构
本文档的用途
权威任务与恢复
权威后台任务
权威存储
权限与敏感信息成果
权限矩阵
架构与实施顺序
架构决策记录
架构目标
架构级验证
架构设计引用
查找与浏览
查询记录
标准质量门禁
标准验证命令
栏目级
栏目级预览有效性
核心业务对象
格式边界
检查清单模板
检测与分析报告
模型与提示词基础
模型与提示词实体组
模型与提示词管理
模型档案
模型档案与提示词主题
模型访问
模型调用与重试分类
模板与导出
模板与导出快照
模板完整性
模板导出边界
模板规则
正面影响
歧义与共同冻结
歧义与覆盖扫描
每个业务模块直接使用供应商
每个里程碑的协作流程
活动日期
测试要求
浏览器使用
深模块用例接口
澄清焦点与生成清单
澄清结论
父任务聚合
版本必须直接开放公网
物理约定
状态约定
状态语义
独立前端
独立实现
独立实现子
独立导出历史与私有副本
独立开发协议
独立运行单元与模块化单体
班级与教师
班级与教师配置
班级区域
班级区域有序且分类校验
生产可用性与恢复
生产安全与部署复审
生产恢复指标延后验收
生产数据语义统一采用
生产部署与未来子系统排除
生产部署复审
生产部署延后
生产部署延后至功能验收后
生产部署延后边界
生成流程
生成行为
生成规则
生成边界
用户与权限
用户故事
用户故事专项回归与
用户故事任务模板
白名单元数据
白名单确定性渲染
的关系
的判断标准
直接修改模板并下载
直接充当轮询任务队列
直接写入教案当前内容
真实验证证据与生产部署延后
知识图谱
码点限制
研究决策
研究方法与决策优先级
确定性与风险相称测试
禁止事项
秒短轮询
租约与恢复
稳定错误码
立即引入事务消息中间件或
管理员
管理员与教师权限矩阵
精准修改
系统架构基线
系统架构定义查询记录
系统架构文档作为下一步
系统架构设计
系统说明
系统默认提示词
纯手工教案浏览器验收
纯手工教案闭环
纯服务端内存
纵向拆分
结构化
结构化预览与采用
结果采用
统一响应与错误
统一授权
脱敏审计
自动化质量门禁
自定义提示词生命周期
自行维护独立权限系统
范围结论
补充建议查询
表关系总览
表格第一行
表格第七行
表格第三大行
表格第二行
表格第五行
表格第八行
表格第六行
表格第四行
规格与计划评审门禁
规格澄清
规格质量检查清单
规格质量清单迭代验证
规范化
计划管理流程
认证与班级授权主题
认证与用户端点
认证授权
设置端点
语义版本与依赖模板同步
语言与命名
负责异步执行
账号与权限
账号规则
质量标准
跨制品分析
轮询契约
输入上下文
迁移序列
迁移顺序
运维与安全
运行单元
运行单元的模块化单体
进度报告与比较规则
远端匹配与任务去重门禁
适配器
逐问逐答与增量回写
通用数据规则
通用模板平台
逻辑架构视图
部分唯一索引与排他约束
部署时序
采用同源入口
采用契约
采用独立
里程碑管理规则
里程碑门禁
里程碑验收
重试分类与三次上限
重试策略
锁定安装与本地依赖
错误与
门禁证据
问号与换行格式
阶段一数据模型
阶段依赖图
阶段零研究与消歧
隐私与审计
集体活动
集体活动与安全
集体活动先拆分后新增
集体活动原始教案
集体活动导入与部分成功主题
集体活动部分成功
集成式
需求与任务语义清单
需求与可度量结果
需求写作的单元测试
需求完整性
需求检查清单
需要直接比较文件
非功能要求
非工作日禁止创建教案
项目上下文
项目定位
项目宪章
项目宪章模板
项目状态
项目结构
预览与采用主题
预览仅随实际输入变化失效
预览显式采用
预览有效性
预览端点
预览采用边界
风险与缓解
风险控制
首期一个运行实例只服务一所幼儿园
首期一日活动计划
首期一日活动计划完整闭环
首期一日活动计划实现任务清单
首期使用
首期功能验收
首期单园运行并保留园所隔离边界
首期完全按无园所维度的单园模型建设
首期容量与响应目标
首期必要设置
首期必要设置主题
首期接入第三方身份平台
首期目标
首期直接建设多园
首期范围
首页与查询
验收标准
验收测试
验收范围
验证基线
验证矩阵
高风险点