activity
actors
admin
adoption
adr
aes
agent
agents
aggregation
alchemy
alembic
and
answer
api
application
architecture
archive
archived
area
argon
association
audit
auth
authentication
authn
authoritative
authorization
backend
background
based
baseline
batch
bff
binding
boundaries
boundary
branch
business
caddy
calendar
canonical
catalog
celery
central
cernet
cffi
cheat
check
child
chinesecalendar
class
classification
clean
client
cloud
code
codex
column
combined
command
common
complete
component
compose
config
configure
constitution
content
context
contract
contracts
contributing
cookie
create
cryptographic
cryptography
csrf
current
cycle
daily
data
database
defer
definition
degradable
degradation
degraded
denylist
dependencies
dependency
deployment
dev
development
dir
direction
directory
dispatch
dispatcher
docker
docs
docx
domain
double
drafts
dramatiq
driven
dual
encryption
engineering
env
envelope
environment
environments
error
escape
essential
event
events
expected
export
exports
external
extraction
extractor
fast
fault
feature
file
find
fingerprint
fingerprints
fixed
for
format
from
frontend
frozen
functional
gcm
generate
generation
get
git
github
graph
graphify
green
group
gui
guide
hard
has
hashing
health
highest
historical
history
holiday
hub
idempotency
identity
implementation
import
indoor
init
initialization
input
integration
invariants
invoke
isolation
issue
job
jobs
json
jsonb
jwt
kafka
key
kindergarten
kit
knowledge
kubernetes
lesson
library
lifecycle
list
lists
local
lock
locking
logic
loop
loopback
main
management
manager
manual
matrix
memory
mfa
migration
milestone
mirror
model
models
modular
monolith
monorepo
name
neutral
new
nginx
nice
nodes
not
old
only
open
operations
optimistic
origin
orm
otp
outcome
outdoor
owasp
package
packages
page
parent
password
paths
pattern
pending
permission
persist
phase
placeholder
plan
planned
plans
policy
port
postgre
postgresql
prd
pre
prerequisites
prevention
preview
privacy
production
profile
prompt
prompts
protection
protocol
provider
proxy
pydantic
pyproject
pyright
pytest
python
quality
query
quickstart
react
read
readme
ready
record
red
redis
reference
reflection
refresh
renderer
repo
repository
repurposed
requirements
research
reset
resolve
rest
results
retry
roadmap
role
root
router
ruff
rules
runner
runtime
safe
same
scheduler
schema
schemas
scope
script
sdd
sdk
sec
secrets
security
semester
sensitive
separate
separator
service
services
settings
setup
seven
shared
sheet
signing
single
skeleton
snapshot
socket
source
sources
spec
specification
specify
speckit
specs
sql
sse
ssrf
stable
status
storage
strategy
structure
submit
system
tag
task
tasks
tdd
teacher
teacherplan
tech
technical
template
tenant
test
testing
tests
text
timor
token
toml
trae
two
type
unit
update
upload
url
user
uui
validation
variables
version
versions
web
with
word
workday
worker
workflow
worktree
yaml
ywyz
一体化进程
一日活动反思
一日活动计划
一日活动计划采用固定
一致性审查
万能口令或维护后门
下一份文档查询记录
下午户外游戏
不单独暴露公网
不开放公众注册
不继承旧仓库架构
不进入首期认证关键路径
与文件挂载
与立即生产实施已失效
专项验证门禁
个人设备
个人设备会话超时
个人设备失窃或恶意软件感染
个人设备完全失陷是残余风险
主密钥不进入代码库
主键策略
乐观锁
五轮一致性验证记录
产品与工程路线图
产品总纲
仍有效
从零生成
从首期开始全面微服务化
任务实施
任务幂等契约
任务模板
任务状态机
任务生成
任务类型
任务转
作为任务最终状态存储
供应商中立
保存任务权威状态
保留同源
修正后的一日活动计划数据模型结论
允许提示词定义输出
公网扫描与自动化攻击
共享基线
共享契约
共享授权与分支门禁
共享文档同步
共享父
共享设计基线
共同基线分支创建
关系表头
内容门禁与操作授权分离
冲突冻结
凭据和邀请全量撤销
出口门禁
分支操作授权门禁
分阶段任务执行与验证
分阶段修复闭环
划分查询记录
创建阶段
前端直接访问数据库或共享
功能目录与可测试规格生成
功能规格生成
功能验收
区分已确认设计与已实现状态
单园部署
单实现开发协议
单次邀请加人工确认激活
历史隐私清理
历史隐私清理与最终
双实现分支任务
受限公网
受限公网单一入口
只向浏览器返回临时文件
只读交叉评审
只读编码前收敛审查报告
只追加收敛任务
只配置一个全局模型
右侧列
右侧列为两行
各任务输入快照
合法导出后外传是残余风险
合法用户导出后外传
同基线分支流程
同时使用子代理进行语义更新
同步执行
后台任务
启动前检查清单
启动清单循环措辞
启动清单循环措辞澄清
唯一公网应用入口
园所与学期月份范围
园所隔离
在线节假日
填写说明
备选方案
复审触发条件
外部依赖故障时失败安全
外部服务失败时默认普通工作日
多通行密钥与高风险操作重新验证
契约与验证指南
契约对齐
完整性验收
实施前检查清单门禁
实施约束
实施规划
实时基线证据
实现任务
实现子
实现授权门禁
实现收敛
审计事实基线
客户端幂等
室内区域游戏
宪章同步影响报告
宪章约束已进入计划与任务
宪章维护
导出格式控制
将所有
将提示词写在代码或环境变量中
工作区修改
工作区修改处置
工作区基线清洁
工作流
工程骨架与质量基线
左侧列
已关闭
已退役
幂等性
并建立管理员专用提示词系统
并行与独立验收校验
延后生产部署
开发协议
异步生成
异步生成与人工采用
当前不能进入编码
待确认
微信小程序
快照原因码与恢复顺序
恢复材料
意图清单与代码差距评估
执行停止条件
执行状态机
拒绝与过期
按用户故事生成可执行任务
授权与
接入天气服务或让教师选择天气标签
控制台一次性首位管理员初始化
推荐执行顺序
提示词生命周期管理
提示词管理系统
操作授权门禁
教学周次
教案与服务端秘密
教案内容结构
教案手工闭环
教案管理
教案结构化
数据库
数据库迁移
数据模型
数据模型设计
数据模型边界查询记录
文件挂载
文件第一行
文件第二行
文档交叉审计合并结论
新增集体环节标红
新报告
无密码
无默认管理员
日期与外部服务采用本地优先和软降级
日期选择与校验
旧图谱未覆盖最新架构
星期与日期
晨间活动
晨间谈话
普通环境变量或日志
最后管理员双人带外核验
最后管理员恢复
有序执行清单
有条件进入
服务最小暴露
本地优先架构
机制延后决定
权限和恢复默认拒绝
架构与实施顺序
查询记录
格式边界
检查清单模板
检测与分析报告
模型与提示词基础
模型调用与重试分类
模板导出
模板导出边界
模板说明契约一致性
模板配置
正文模式
歧义与覆盖扫描
每个业务模块直接使用供应商
消息队列
澄清焦点与生成清单
然后思考还需要完成什
然后思考还需要完成什么任务
父任务聚合
状态日期
独立前端
独立开发协议
独立授权边界
班级与教师
班级与教师配置
生产前安全验证门禁
生产数据库
生产部署复审
生产部署实现仍延后
生产部署延后
生产部署非目标
生成边界
的入口与恢复延后部分
的密码认证部分
目录索引
直接修改模板并下载
直接充当轮询任务队列
直接写入教案当前内容
禁用空白
离线恢复码加人工核验
私有服务信任边界
私有服务面
租约与恢复
立即引入事务消息中间件或
第一行
第二行
管理员创建账号并发放单次邀请
粒度与任务映射
系统架构定义查询记录
系统架构文档作为下一步
系统架构设计
系统说明
终端失陷与下载后外传的组织残余风险
继续采用
编码前审查报告
范围结论
补充建议查询
表格第一行
表格第七行
表格第三大行
表格第二行
表格第五行
表格第八行
表格第六行
表格第四行
规格与计划评审门禁
规格模板
规格澄清
规格质量检查清单
规格质量清单迭代验证
规范化
计划模板
认证授权与身份审计
设计与草拟阶段
语义更新待确认
语义版本与依赖模板同步
请使用
负责异步执行
贡献指南
跨制品分析
轮询契约
运行单元的模块化单体
进行更新
远端匹配与任务去重门禁
逐次授权的短时导出下载
逐问逐答与增量回写
通用模板平台
通行密钥与双条件恢复
通行密钥丢失
通行密钥唯一常规登录
避免日期专用文档提交
邀请或微信弱兜底
邀请链接泄露
部分取代
采用受限公网入口
采用独立
重新验证与远程撤销
钓鱼和账号接管
门禁体系
问号与换行格式
阶段一数据模型
阶段状态一致性
阶段零研究与消歧
阻塞项统一修复执行方案
集体活动
集体活动部分成功
集成式
需求与任务完整覆盖
需求与任务语义清单
需求写作的单元测试
需求检查清单
需要直接比较文件
非工作日禁止创建教案
非破坏性工作区保留
项目上下文
项目宪章
项目宪章模板
预览与采用流程
预览有效性
首期一日活动计划完整闭环
首期使用
首期安全威胁模型
首期实现与验收合同
首期必要设置
首期接入云厂商密钥管理服务
驱动的
验收门禁