access
actions
activity
adr
age
agent
agents
alembic
alignment
ambiguity
analysis
and
answer
anti
api
append
architecture
areas
artifacts
assess
assign
assignment
assumptions
ast
audit
auth
authentication
authoritative
authors
background
batch
bearer
bff
blocking
boundary
branch
brief
build
cache
caddy
calendar
canonical
capabilities
cases
category
celery
central
check
checklist
checks
child
clarifications
class
classes
classify
clean
cloud
code
codebase
codex
combined
command
common
compact
complete
completeness
completion
complexity
compose
concerns
constitution
constraints
content
context
contracts
controls
conventions
converged
convergence
cookie
core
counts
coverage
create
criteria
cross
csrf
current
cutting
daily
data
database
defer
definitions
degradable
delivery
dependencies
deployment
description
design
detection
development
dir
directory
disclosure
dispatch
docker
docs
documentation
docx
done
dramatiq
dual
duplication
each
edge
efficiency
efficient
english
entities
env
envelope
escape
events
example
examples
execution
expired
export
exports
extension
external
faq
fast
fdfind
feature
file
find
findings
fingerprint
first
fixed
for
format
foundation
foundational
from
functional
gaps
gates
generate
generation
get
git
goal
governance
graphify
grep
groups
gui
guidelines
handoff
has
health
highest
hooks
http
hub
idempotency
iii
implementation
include
inconsistency
incremental
infrastructure
init
initialize
input
intent
inventory
invoke
involves
issue
items
job
jobs
json
jsonb
kafka
key
kindergarten
kindergartenmanager
kindergartens
kit
kubernetes
lesson
lite
live
load
local
machine
main
management
manager
mandatory
measurable
milestone
model
models
modular
monolith
mvp
name
negotiable
neutral
new
next
nginx
nice
nodes
non
not
notes
offer
only
open
operating
opportunities
optional
order
organization
origin
out
outcome
outcomes
outline
parallel
passes
path
paths
pending
persist
phase
phases
plan
plans
polish
post
postgre
postgresql
prd
pre
prerequisites
present
preview
principle
principles
priority
produce
production
profile
profiles
progressive
project
prompt
prompts
provide
provider
purpose
python
quality
query
quick
quickstart
react
read
readiness
readme
ready
red
redis
refresh
remediation
repo
report
repository
request
requested
required
requirement
requirements
research
resolve
results
risk
roadmap
roles
root
rules
runs
saa
same
sample
scenarios
schema
scope
script
sdd
sdk
seam
secrets
section
semantic
semesters
separate
separator
services
session
settings
setup
severity
shared
skill
snapshots
socket
source
sources
spec
specification
specify
speckit
specs
sql
sse
ssrf
state
steps
storage
story
strategy
structure
success
summary
system
target
task
tasks
tdd
teachers
team
technical
template
test
testing
tests
the
this
title
token
tokens
tracking
trae
ttl
type
types
underspecification
unit
until
update
user
users
uui
versions
wcag
web
what
when
within
word
workday
worker
ywyz
一体化进程
一日活动反思
一日活动反思填写说明
一日活动计划
一日活动计划业务不变量
一日活动计划模型
一日活动计划系统的数据实体
一日活动计划系统说明
一日活动计划采用固定
一致性审查
一致性边界
一键四栏目
一键生成
一键生成与分栏目生成
一键生成四栏目
七个任务级提示词
七个稳定任务级提示词
七个稳定提示词
七个稳定提示词及来源
三个运行单元
三进程启动
上传与立即清理
上传边界
下一份文档查询记录
下午户外游戏
不包含范围
不可变与不使用触发器
不可变导出输入与文件
不可误读的已确认决策
不等于公网开放
不继承旧仓库架构
与任务契约
与共享契约
与可信上下文
与契约
与契约同步
与实现分支启动
与工作日服务
与工程技能规则
与提示词
与提示词架构
与提示词规则
与文件挂载
与文件架构
与旧仓库
与旧仓库的关系
与来源信任
与架构
与模型地址
与立即生产实施已失效
与页面信息架构
与验收合同
专项验证
专项验证门禁
临时文件与原子输出
主加密密钥来源
主密钥不进入代码库
主要稳定错误码
乐观锁
乐观锁契约
乐观锁禁止静默覆盖
事务与可恢复性
事务与并发不变量
事务所有权
事实来源
事实来源与优先级
事实来源与冲突处理
事实来源与旧仓库取舍
事实来源与范围忠实
事实来源冲突时停止固化实现
二十六项问题的最终结论
五轮一致性验证记录
交互契约
交付范围
交叉审计事项
交接与恢复工作
产品与工程路线图
产品与部署
产品只交付
产品目标
产品背景
仅允许本地开发与测试最小依赖
仍有效
仍需后续设计的内容
从旧系统吸收的经验
从零生成
从首期保留园所隔离边界
从首期开始全面微服务化
代价与风险
代码组织与依赖方向
令牌与
任务与
任务与栏目级采用
任务与栏目采用验收
任务头
任务实施
任务幂等契约
任务状态与幂等
任务状态机缺少
任务生成
任务类型
任务身份
任务转
会话与密钥安全
会话链路
作为任务最终状态存储
作者署名与当前授权分离
使用边界
供应商中立
依赖基线
依赖方向
保存任务权威状态
保持最小实现
保留与任务关系
保留的路线经验
修复验证记录
修改处置记录
修正后的一日活动计划数据模型结论
健康语义
允许提示词定义输出
先写失败测试
先定义完成标准
先理解再编码
六栏目
六阶段迁移顺序
共享基线
共享契约
共享授权与分支门禁
共享文档与模板同步
共享文档同步
共享文档独立提交同步
共享父
共享设计基线
共同分支基线
共同基线分支创建
共同实施路线
关系总览
关系表头与
关联决策
关键事务不变量
关键事务与状态不变量
关键架构决策摘要
兼容性
内容修复
内容门禁与操作授权分离
冲突与高影响歧义共同冻结
冲突冻结
决策之间有什么依赖
决策索引
决策范围
出口门禁
分支与
分支内验证
分支协作规范
分支实现独立授权门禁
分支操作授权门禁
分支模型与所有权
分栏目生成
分阶段任务执行与验证
分阶段修复闭环
划分查询记录
创建后活动日期不可修改
创建或打开计划
创建阶段
初始化
前提与反目标
前端直接访问数据库或共享
前端页面信息架构
功能完成前延后生产部署与访问网络决策
功能完成后
功能完成后的复审
功能目录与可测试规格生成
功能规格模板
功能规格生成
功能验收
加密与密钥
加密与数据最小化
加密算法
包含范围
区分已确认设计与已实现状态
区域按目标栏目校验
单元测试
占位符与确定性渲染
历史与最终基线
历史快照
历史快照触发边界
历史恢复保留恢复前内容
历史恢复快照原因
历史清理与
历史版本
历史计划状态与当前状态相区分
历史隐私清理
历史隐私清理与最终
历史隐私清理完成并关闭
双实现分支任务
双实现分支授权
双实现分支授权门禁
反思三字段与
反思与集体活动部分成功
反思与集体部分成功
反思事务验收
反思结构与长度
取代的标记
变量白名单
只交付
只向浏览器返回临时文件
只读交叉评审
只读编码前收敛审查报告
只追加收敛任务
只配置一个全局模型
只需核验或增加导航的事项
可执行验证与真实证据
可收集且业务断言失败的
可测试性
可观测性与审计
右侧列
右侧列为两行
各任务输入快照
合并范围与事实来源
同基线分支流程
同时使用子代理进行语义更新
同时维护本地版和
同步执行
同源访问
同班同日唯一当前教案
后台任务与
后台任务架构
后台任务父子与重试外键
后台任务状态
后台任务状态机
后台任务状态机与
后台任务状态集合
后端模块内部方向
后端模块单向依赖
后续子系统
后续扩展边界
启动三个独立进程
启动前检查清单
启动清单循环措辞
启动清单循环措辞澄清
周次与班级
和旧仓库的文件思考如何撰写
哪些关键架构决策需要独立
哪些已经确认
唯一约束
园所与事务边界
园所与学期月份范围
园所与班级授权
园所与班级隔离
园所与身份
园所与身份实体组
园所与身份模型
园所数据隔离边界
园所组合外键矩阵
园所组合外键规则
园所隔离
园所隔离与服务端授权
园所隔离与组合外键
固定结构化
固定结构化结果
固定阅读顺序
在线节假日
基本规则
基础能力
基线证据
填写说明
备选方案
复审触发条件
复审输入
外部服务失败时默认普通工作日
外部集成
外键与删除行为
契约与验证指南
契约对齐
契约快速检查
契约总则与端点目录
契约演进
字符串
学期与周次
学期外周次双空
学期外周次双空检查约束
学期外教学周次双空
学期管理
学期首周边界
安全与范围约束
安全与隐私硬性规则
安全审计与降级要求
安全方案
安全测试
安全边界
完成交付
完成后的授权动作
完整性验收
完整验收
完整验收记录
实施与验证约束
实施依赖
实施前检查清单门禁
实施约束
实施规划
实施计划模板
实施顺序
实时基线证据
实现任务
实现共享基础
实现分支授权边界
实现分支操作待单独授权
实现子
实现授权门禁
实现收敛
实现时禁止的捷径
实际检查与结果
审计与敏感信息
审计与日志快照边界
审计与降级验收
审计事件
审计事实基线
审计事实来源链
审计只插入约束
审计只记录必要元数据
审计模型
审计端点
审计结论不授权后续操作
审计至少保留一年
审计证据与协作边界
客户端幂等
室内区域游戏
宪章同步影响报告
宪章检查与两阶段设计门禁
宪章约束已进入计划与任务
宪章维护
容量与性能
密码与登录保护
密钥与安全
密钥与安全边界
对象存储接口预建
导出与历史
导出与历史验收
导出前必须成功保存
导出前检查
导出历史
导出快照
导出格式控制
导出模型
导出流程
导出端点
导出记录
将所有
将提示词写在代码或环境变量中
尚待后续详细设计的内容
层级与状态隔离
工作区修改
工作区修改处置
工作区基线清洁
工作日
工作日与日期服务
工作日与软降级
工作日来源与三类缓存
工作日校验
工作日缓存
工作日超时
工作流
工具优先级
工程骨架
工程骨架与质量基线
左侧列
已关闭
已具备
已安装工具与技能
已完成的共享文档同步
已完成的检查面
已排除范围
已确认满足的规则
幂等与恢复
幂等与恢复扫描
幂等与租约约束
幂等契约
幂等键定义
年级组长和园级检查
并保留决定权
并发与重试
并建立管理员专用提示词系统
并行与独立验收校验
并行示例
幼儿园信息
幼儿园教育管理系统
应用事务不变量
延后验收
建议执行顺序
建议目录
建议解锁顺序
开发协议
开发工作流与质量门禁
开发规则
开始工作前
异常与降级
异步任务与反馈
异步任务与外部
异步任务和安全边界是什么
异步提示词测试冻结配置
异步状态
异步生成
异步生成与人工采用
张表总览
归档与不可变历史
归档只读与恢复编辑
归档教案仍占唯一键
当前不能进入编码
当前仓库与分支状态
当前共同下一步
当前学期与学期外日期
当前学期和学期外日期
当前文档与已满足规则
当前状态快照
当前阶段
当前非目标
待确认
必测数据行为
必要设置
必要设置与权限
必须另行决定
必须实现的
必须更新的事实来源
快照不是重复日志
快照创建与不可变规则
快照原因码与恢复顺序
快照只表达可恢复内容变化
快照只表达可恢复变化
性能与扩展
总体建模原则
总体架构
恢复机制
意图清单与代码差距评估
成功标准
手工教案
执行停止条件
执行授权边界
执行授权边界与
执行状态机
执行范围与基线
扩展与命名
批任务
技术与依赖基线
技术基线
技术基线与依赖
投递与租约
投递协调
拒绝与清理约束
拒绝与过期
按用户故事生成可执行任务
授权与身份审计
接下来需要生成什么文件呢
接入天气服务或让教师选择天气标签
推荐执行顺序
提示词
提示词与
提示词服务
提示词服务与确定性渲染
提示词模型
提示词测试冻结输入
提示词测试同样异步执行
提示词测试运行
提示词白名单与发布版本
提示词端点
提示词管理
提示词管理子系统
搜索规范
操作与交付边界
操作待单独授权
操作授权门禁
故事与收尾阶段
故障与降级
故障与降级矩阵
故障和恢复测试
故障时保留
故障隔离矩阵
敏感信息处理边界
敏感数据
教学周按周一递增
教学周次
教学设置
教学设置实体组
教学设置模型
教师与班级
教师处理集体活动原始教案
教师完成纯手工教案闭环
教师导出并重新下载固定
教师按栏目使用
教师控制
教师班级权限与管理员全园访问
教师纯手工教案闭环
教师获得可降级服务
教案与结构化正文
教案乐观锁更新
教案六大正文栏目
教案展示快照
教案快照
教案快照原因码
教案手工闭环
教案栏目与格式
教案端点
教案管理
教案结构化
数据与事务设计
数据与安全
数据与架构边界
数据保留与清理
数据库
数据库与首次初始化
数据库删除规则
数据库迁移与首次初始化
数据快照边界
数据所有权
数据架构
数据模型
数据模型与
数据模型与园所隔离
数据模型测试与验收
数据模型设计
数据模型边界查询记录
文件与状态约束
文件名与存储
文件命名
文件挂载
文件第一行
文件第二行
文档交叉审计合并结论
文档同步
文档命名与
文档状态
文档目的
文档职责与工具基线
文档职责与开发工具
文档门禁与工程初始化
新增集体活动环节的插入位置
新增集体环节标红
新报告
日志与错误处理
日期与上下文规则
日期与历史
日期与外部服务采用本地优先和软降级
日期与权限
日期校验只软提示
日期规则
日期选择与校验
旧仓库经验
旧仓库经验与反例
旧仓库经验对照
旧图谱未覆盖最新架构
时间与日期
时间与日期语义
明确不做
明确不继承的旧模型
明确不重复的旧路线
星期与日期
星期与日期格式
是生产事实来源
晨间活动
晨间谈话
普通环境变量或日志
更新规则
最后一个有效管理员不可停用
最小实现边界
最小独立故事
最小跨进程任务契约
最终候选基线
最终共享基线完成并关闭
最终决策与授权边界
最终结论
有序执行清单
有条件进入
服务最小暴露
服务边界
服务边界与依赖方向
服务边界与单向依赖
未来再迁移
本地优先
本地优先架构
本文档的用途
机制延后决定
权威任务
权威任务与恢复
权威任务和可靠投递
权威后台任务
权威存储
权威状态
权限与园所边界
权限矩阵
枚举和规范化
架构与实施顺序
架构决策记录
架构总览
架构目标
架构级验证
架构设计引用
查找与浏览
查询记录
标准质量门禁
标准验证命令
栏目级预览有效性
栏目级预览有效性与采用并发
核心业务对象
核心关系图
格式边界
检查清单模板
检测与分析报告
模块边界
模型与契约
模型与提示词
模型与提示词基础
模型与提示词实体组
模型与提示词管理
模型总览
模型档案
模型访问
模型调用与重试分类
模板与导出
模板与导出快照
模板保真
模板完整性
模板导出边界
模板真实个人信息
模板脱敏与历史清理边界
模板规则
模板说明
模板说明与业务规则
模板说明契约一致性
正面影响
歧义与共同冻结
歧义与覆盖扫描
每个业务模块直接使用供应商
每个里程碑的协作流程
注意事项
活动日期
测试与可访问性
测试与架构验证
测试与验收
测试要求
浏览器使用
浏览器验收路径
深模块接口
深模块用例接口
澄清焦点与生成清单
然后思考还需要完成什
然后思考还需要完成什么任务
照片与视觉子系统
父任务聚合
父任务聚合与显式重试
版本必须直接开放公网
物理约定
物理边界
状态与操作类别
状态定义
状态收敛
状态日期
状态机
状态约定
状态获取
状态语义
独立前端
独立实现
独立实现子
独立导出历史与私有副本
独立开发协议
独立授权边界
独立运行单元与模块化单体
班级与教师
班级与教师配置
班级区域
班级区域有序且分类校验
生产可用性与恢复
生产备份和部署
生产安全与部署复审
生产恢复指标延后验收
生产数据语义统一采用
生产部署与未来子系统排除
生产部署复审
生产部署延后
生产部署延后至
生产部署延后至功能验收后
生产部署延后边界
生产部署非目标
生成与采用
生成流程
生成行为
生成规则
生成边界
用户与权限
用户故事
用户故事专项回归与
用户故事任务模板
登录与会话
白名单元数据
白名单确定性渲染
的关系
的判断标准
直接修改模板并下载
直接充当轮询任务队列
直接写入教案当前内容
真实验证证据与生产部署延后
知识图谱
码点限制
研究决策
研究方法与决策优先级
确定性与风险相称测试
确定性测试边界
禁止事项
秒短轮询
租约与恢复
稳定错误码
立即引入事务消息中间件或
端点文档
端点目录
第一可用业务
第一行
第三行
第二行
第五行
第六行
第四行
管理员
管理员与教师权限矩阵
管理员安全初始化与必要设置
管理员完成安全初始化与必要设置
管理员审计与可降级服务
管理员审计关键操作
管理员配置模型与提示词
粒度与任务映射
精准修改
系统支撑
系统架构基线
系统架构定义查询记录
系统架构文档作为下一步
系统架构文档应如何定义目标服务架构
系统架构设计
系统说明
系统默认提示词
索引原则
红灯绿灯最小实现循环
纯手工教案
纯手工教案浏览器验收
纯手工教案闭环
纯服务端内存
纵向拆分
组合外键矩阵
组织判断
结构化
结构化预览与教师采用
结构化预览与采用
结构边界
结果与教师控制
结果清理与一年审计
结果采用
结果采用边界
统一响应与错误
统一授权
统一错误
继续有效的安全结果
缓存与来源
编码前审查报告
编码前审查报告证据
编码前审查解决方案
编码前有序启动流程
编辑与
联合结论
脱敏审计
自动保存失败
自动化质量门禁
自定义提示词生命周期
自然周起始日
自行维护独立权限系统
节假日与日期服务
范围结论
补充建议查询
表关系总览
表格第一行
表格第七行
表格第三大行
表格第二行
表格第五行
表格第八行
表格第六行
表格第四行
覆盖范围
规格与计划评审门禁
规格澄清
规格状态
规格质量检查清单
规格质量清单迭代验证
规范化
规范化列与状态代码
计划管理流程
认证与授权
认证与用户端点
认证授权
设置端点
设计与草拟阶段
设计依据
设计来源与旧系统取舍
证据与分支流程
语义更新待确认
语义版本与依赖模板同步
语言与命名
请使用
请根据现有文档
负责异步执行
账号与权限
账号规则
质量基线
质量标准
跨制品分析
跨行事务不变量
跨进程任务契约
轮询契约
输入上下文
输入快照
边界与可信上下文
迁移序列
迁移测试
迁移顺序
迁移顺序建议
运维与安全
运行单元
运行单元的模块化单体
进度报告与比较规则
进行更新
远端匹配与任务去重门禁
适配器
选型与用途
逐任务最小变量白名单
逐问逐答与增量回写
通用数据规则
通用模板平台
通用类型与默认值
通用规则
通用请求与响应
逻辑架构视图
逻辑视图
避免日期专用文档提交
部分唯一索引与排他约束
部署拓扑与首期实施顺序
部署时序
配置分级
采用同源入口
采用契约
采用独立
里程碑依赖链
里程碑管理规则
里程碑门禁证据
里程碑验收
重试与反馈
重试分类与三次上限
重试策略
锁定安装与本地依赖
错误与
错误与幂等
门禁体系
门禁最终判断
门禁证据
门禁验证状态
问号与换行格式
阶段一数据模型
阶段依赖图
阶段状态一致性
阶段零研究与消歧
阻塞项统一修复执行方案
阻断所有用户故事
阻断项
降级与质量
隐私与审计
集体活动
集体活动与安全
集体活动先拆分后新增
集体活动导入与生成
集体活动拆分与新增环节流程
集体活动新增环节标记
集体活动部分成功
集成式
集成测试
需求与任务完整覆盖
需求与任务语义清单
需求与可度量结果
需求写作的单元测试
需求检查清单
需要直接比较文件
静态验证
非功能要求
非工作日禁止创建教案
非破坏性工作区保留
页面信息架构与无障碍
项目上下文
项目定位
项目宪章
项目宪章模板
项目文档更新矩阵
项目状态
预览与导出
预览仅随实际输入变化失效
预览显式采用
预览有效性
预览端点
预览采用边界
风险与缓解
首位管理员
首期一个运行实例只服务一所幼儿园
首期一日活动计划功能规格
首期一日活动计划完整闭环
首期一日活动计划完整闭环任务清单
首期一日活动计划实现计划
首期使用
首期使用一套
首期功能验收
首期单园运行并保留园所隔离边界
首期完全按无园所维度的单园模型建设
首期实现与验收合同
首期容量与响应目标
首期必要设置
首期接入云厂商密钥管理服务
首期接入第三方身份平台
首期时区权限
首期目标
首期直接建设多园
首期范围
首期表清单
首页与查询
驱动的
验收合同
验收标准
验收测试
验收范围
验证基线
验证矩阵
验证要求
高风险点