acceptance
accepts
access
accessibility
account
accounts
across
actions
activate
active
activity
actor
actors
actual
adapter
adb
add
admin
administration
administrator
adoption
adr
aes
afb
after
afternoon
age
agent
agents
alchemy
alembic
all
allowed
allowlist
allows
alpine
always
and
answer
any
api
app
append
application
approval
apps
architecture
archive
archived
are
area
argon
artifact
asgi
assert
assignment
association
astral
async
asynchronous
atomic
attributed
audit
audited
auth
authenticate
authentication
authn
author
authoritative
authorization
authorship
automated
available
back
backend
background
base
based
baseline
batch
bbc
before
bff
bind
binding
blank
block
bootstrap
boundaries
boundary
bounded
bounds
branch
broker
browser
build
business
bytes
cache
caddy
calendar
call
can
cannot
canonical
capabilities
ceadfe
celery
central
ceremonies
ceremony
cernet
challenge
change
changes
characters
check
checked
checklist
checkout
checkpoint
child
chinese
chinesecalendar
chromium
class
classification
clean
clear
clears
cli
click
client
clock
closed
cloud
code
codes
codex
collection
column
combined
command
commit
common
compatible
complete
completed
components
compose
composite
concurrency
config
configuration
configure
configured
conftest
connect
connection
consistently
constitution
constraints
contains
content
contents
context
contract
contracts
contributing
control
controlled
cookie
cookies
copyright
count
create
creates
credential
credentials
cross
cryptography
csrf
current
cycle
daily
daniel
data
database
date
datetime
deactivate
deactivated
decision
declarative
declared
decode
default
defer
deferred
definition
degradable
degradation
degrades
delay
delivery
dependencies
dependency
deployment
derived
design
detail
deterministic
dev
development
dict
dir
direction
directory
disabled
discoverable
dispatch
docker
docs
document
docx
does
domain
double
downgrade
drafts
dramatiq
driven
dual
during
each
ebe
echoing
empty
encode
encryption
endpoints
engineering
enqueue
enroll
entity
entrypoint
enum
env
envelope
environment
environments
equivalent
error
errors
escape
essential
event
evidence
exactly
exception
execution
expand
expired
expires
expiry
explicit
explicitly
exponential
export
exports
expose
exposes
extension
external
extra
extraction
factory
fails
failure
failures
fake
fallback
false
family
fan
fast
fault
feature
fidelity
field
fields
fifteen
fifth
file
final
find
fingerprint
first
fixed
fixtures
flow
flows
for
foreign
format
foundation
foundational
four
framework
free
from
frozen
functional
game
gate
gates
gcm
generate
generation
generic
get
git
github
global
governance
graph
graphify
green
group
gui
guide
handles
hard
has
hash
hashed
head
header
headers
health
helpers
highest
historical
history
hop
http
httponly
httpx
hub
human
idempotency
idempotent
identifiers
identity
ids
ignores
image
immutable
implementation
import
importable
inactive
independent
indoor
init
initialization
initialize
input
inputs
insecure
insert
installation
instances
internal
invalid
invariants
invitation
invoke
isolated
isolation
isready
issue
job
jobs
json
jsonb
jwt
kafka
keeps
key
keys
kindergarten
kit
knowledge
kubernetes
last
latest
layers
lease
least
length
lesson
level
lib
library
license
lifecycle
limit
limited
limits
lines
lint
list
lists
live
liveness
load
local
lock
locked
locks
log
logged
logging
login
logout
loop
loopback
lose
loses
lowercase
main
mainland
malformed
management
manager
manual
mapping
masks
master
match
matches
matrix
membership
memory
merge
merges
message
metadata
mfa
middleware
miessler
migrated
migration
migrations
milestone
minimal
minute
minutes
mirror
missing
mit
mode
model
models
modular
modules
monkey
monolith
monorepo
morning
most
mutable
mvp
name
native
navigation
needs
negative
nested
network
neutral
never
new
next
nfkc
nginx
nice
nodes
non
normalize
normalizes
not
notice
now
null
observability
offline
one
online
only
opaque
open
openapi
optimistic
optional
order
ordering
origin
origins
orm
otp
out
outcome
outdoor
outputs
outside
overrides
package
packages
page
pages
pagination
parent
parse
passkey
password
passwords
paste
patch
path
paths
pattern
payload
peer
peers
pending
performance
permission
persist
persistence
persists
phase
phone
ping
pinned
plan
planned
plans
playwright
policy
polling
popen
port
ports
positive
post
postgre
postgres
postgresql
prd
pre
prerequisites
preserve
preserves
preview
privacy
process
processor
product
production
profile
profiles
project
prompt
prompts
protection
protocol
provided
provider
provides
proxy
prune
psycopg
public
pull
push
pydantic
pyproject
pyright
pytest
python
quality
query
quickstart
random
rate
raw
react
read
readable
readiness
readme
ready
real
rebuild
rebuilds
receive
reconstruction
record
recoverability
recovery
red
redact
redacted
redaction
redis
reference
reflection
refresh
refuses
register
registers
registration
rehash
reject
rejected
rejects
relational
release
reliable
removes
rendering
repeated
replaced
replacement
replay
repo
reports
repository
repr
repurposed
request
requested
require
required
requirement
requirements
requires
research
reset
resolve
resource
resources
response
responses
result
retry
returns
review
revision
revocation
revoke
revokes
roadmap
role
roles
rolls
root
rotate
rotates
rotation
routers
routes
ruff
rules
run
runner
running
runtime
safe
same
scalar
scheduler
schema
schemas
scope
scoped
script
sdd
sdk
seam
sec
seclists
secret
secrets
sections
secure
security
seeds
select
selected
semantics
semester
send
sensitive
separate
separator
sequence
serializes
serve
server
service
services
session
sessionmaker
sessions
set
sets
settings
setup
sha
shape
shared
short
signed
signing
single
six
skeleton
slice
smoke
snapshot
socket
soft
source
spaces
spec
specification
specify
speckit
specs
split
spoofed
sql
sse
ssrf
stable
stack
standard
starts
state
status
step
stop
storage
stored
story
str
strings
strips
strong
structlog
structure
structured
stub
submit
success
suite
summary
supplied
supply
sync
system
tables
tag
talk
task
tasks
tcp
tdd
teacher
tech
technical
template
temporary
test
testing
tests
text
the
then
thirty
thread
throttle
time
timeout
timestamps
token
tokens
toml
trace
trae
transaction
transactional
transport
trimmed
true
trusted
trustworthy
two
txt
type
ubuntu
unauthenticated
unavailable
unbounded
unconfigured
unhandled
unicode
unidirectional
unified
unique
unit
unix
until
untrusted
update
upgrade
upstream
url
urls
user
username
users
uses
uuid
valid
validate
validation
validity
values
var
variable
variables
verification
verified
verify
version
versions
violations
visible
volume
wait
warnings
warranty
weak
web
when
window
with
within
without
word
workday
worker
workflow
worktree
write
writes
wrong
yaml
ywyz
一体化进程
一日活动反思
一日活动计划
一日活动计划采用固定
一致性审查
万能口令或维护后门
下一份文档查询记录
下午户外游戏
不单独暴露公网
不导入后端模型或
不开放公众注册
不继承旧仓库架构
不进入首期认证关键路径
与文件挂载
与监听地址组合
与确定性测试消息代理装配
与立即生产实施已失效
与规范化函数
与追踪
专项验证门禁
业务调用始终经过同源
个人设备
个人设备会话超时
个人设备失窃或恶意软件感染
个人设备完全失陷是残余风险
中唯一允许传递的最小任务消息
中文认证页面
中间件
为请求该夹具的测试创建并清理独立
主密钥不进入代码库
产品总纲
仅绑定回环地址的
仍有效
从进程环境构造真实
从零生成
从首期开始全面微服务化
任务实施
任务幂等契约
任务模板
任务生成
任务类型
任务转
会话轮换
作为任务最终状态存储
使用的后端能力
供应商中立
保存任务权威状态
保留同源
修复方案历史执行快照
修正后的一日活动计划数据模型结论
允许提示词定义输出
公网扫描与自动化攻击
共享基线
共享契约
共享授权与分支门禁
共享文档同步
共享父
共享的稳定数据契约
共同基线分支创建
内容门禁与操作授权分离
冲突冻结
凭据和邀请全量撤销
出口门禁
分支操作授权门禁
分阶段任务执行与验证
分阶段修复闭环
分页和
划分查询记录
创建阶段
前端直接访问数据库或共享
功能目录与可测试规格生成
功能规格生成
加载权威上下文
区分已确认设计与已实现状态
单园部署
单实现开发协议
单次邀请加人工确认激活
历史隐私清理
历史隐私清理与最终
双实现分支任务
双实现本地开发档位的
受限公网
受限公网单一入口
只允许回环
只向浏览器返回临时文件
只接受显式配置的回环
只接收
只读交叉评审
只读编码前收敛审查报告
只追加收敛任务
只配置一个全局模型
右侧列
右侧列为两行
各任务输入快照
合法导出后外传是残余风险
合法用户导出后外传
同基线分支流程
同时使用子代理进行语义更新
同步执行
后续里程碑将从
启动前检查清单
启动清单循环措辞
启动清单循环措辞澄清
和本机
唯一公网应用入口
园所与学期月份范围
园所隔离
在线节假日
填写说明
备选方案
复审触发条件
外部依赖故障时失败安全
外部服务失败时默认普通工作日
外部边界所需的最小
多通行密钥与高风险操作重新验证
契约与验证指南
契约对齐
完整性验收
实施前检查清单门禁
实施约束
实施规划
实时基线证据
实时授权
实现任务
实现子
实现授权门禁
实现收敛
实际资源与语义输入的
审计事实基线
客户端幂等
客户端的公开接缝
室内区域游戏
宪章同步影响报告
宪章约束已进入计划与任务
宪章维护
密码与
导出格式控制
将当前请求关联字段合并到真实
将所有
将提示词写在代码或环境变量中
工作区修改
工作区修改处置
工作区基线清洁
工作流
左侧列
已关闭
已退役
并保留响应原始多值头
并在异常时交给
并建立管理员专用提示词系统
并行与独立验收校验
应用装配
延后生产部署
开发协议
异步生成
当前不能进入编码
待确认
微信小程序
快照原因码与恢复顺序
恢复材料
意图清单与代码差距评估
所有查询都显式绑定
执行停止条件
执行状态机
拒绝与过期
拒绝在非开发环境或非回环地址关闭
按固定
按用户故事生成可执行任务
授权与
接入天气服务或让教师选择天气标签
控制台一次性首位管理员初始化
推荐执行顺序
提示词管理系统
撤销与最后管理员保护
操作授权门禁
教学周次
教案与服务端秘密
教案结构化
数据库
数据库迁移
数据模型边界查询记录
文件挂载
文件第一行
文件第二行
文档与基础机器契约
文档交叉审计合并结论
新增集体环节标红
新报告
无副作用的本地就绪检查
无密码
无默认管理员
日志中的凭证和内部
日期与外部服务采用本地优先和软降级
日期选择与校验
旧图谱未覆盖最新架构
星期与日期
晨间活动
晨间谈话
普通环境变量或日志
最后管理员双人带外核验
最后管理员恢复
有序执行清单
有条件进入
有界窗口实现
服务最小暴露
服务端
本地优先架构
本地入口
机制延后决定
权限和恢复默认拒绝
架构与实施顺序
查询记录
格式边界
检查清单模板
检测与分析报告
模型调用与重试分类
模板导出
模板导出边界
模板说明契约一致性
模板配置
歧义与覆盖扫描
每个业务模块直接使用供应商
测试可使用
消息队列
澄清焦点与生成清单
然后思考还需要完成什
然后思考还需要完成什么任务
父任务聚合
状态日期
独立前端
独立开发协议
独立授权边界
独立运行单元
班级与教师
班级与教师配置
生产前安全验证门禁
生产数据库
生产部署实现仍延后
生产部署延后
生产部署非目标
生成导航
生成边界
由应用层统一开启事务
的入口与恢复延后部分
的密码认证部分
的身份
目录索引
直接修改模板并下载
直接充当轮询任务队列
直接写入教案当前内容
确定性替身
禁止提交与应用事务边界
禁止静默回退到共享数据库
禁用空白
离线恢复码加人工核验
私有服务信任边界
私有服务面
租约与恢复
立即引入事务消息中间件或
第一行
第二行
签名密钥同时存在时全局安全配置才可用
管理员创建账号并发放单次邀请
管理员账号管理页面
粒度与任务映射
系统架构定义查询记录
系统架构文档作为下一步
系统说明
终端失陷与下载后外传的组织残余风险
结构化日志和最终脱敏处理器
统一异常转换与健康端点
统一错误
继续采用
编码前审查报告
范围结论
补充建议查询
表格第一行
表格第七行
表格第三大行
表格第二行
表格第五行
表格第八行
表格第六行
表格第四行
表示创建成功
表示系统已经初始化
规格与计划评审门禁
规格模板
规格澄清
规格质量清单迭代验证
规范化
角色与
计划模板
计算覆盖路由
设计与草拟阶段
语义更新待确认
语义版本与依赖模板同步
请使用
负责异步执行
贡献指南
跨制品分析
跨服务使用的公共
身份用例
转发请求
轮换与
轮询契约
运行单元
运行单元的模块化单体
返回测试数据库
进行更新
远端匹配与任务去重门禁
逐次授权的短时导出下载
逐问逐答与增量回写
递归清除
递归清除日志中的密钥
通用模板平台
通行密钥与双条件恢复
通行密钥丢失
通行密钥唯一常规登录
避免日期专用文档提交
邀请或微信弱兜底
邀请链接泄露
部分取代
采用受限公网入口
采用独立
重新验证与远程撤销
钓鱼和账号接管
门禁体系
问号与换行格式
阶段一数据模型
阶段状态一致性
阶段零研究与消歧
集体活动
集体活动部分成功
集成式
需求与任务完整覆盖
需求与任务语义清单
需求写作的单元测试
需求检查清单
需要直接比较文件
非工作日禁止创建教案
非破坏性工作区保留
页面与同源
项目宪章模板
预览有效性
首位管理员初始化必须在单一数据库事务内完成
首期使用
首期安全威胁模型
首期接入云厂商密钥管理服务
驱动的
验收门禁
验证最小消息
验证进程启动时的